# Pandas

In this tutorial, we further explore other methods in pandas.

- [Lambda Function](#Lambda-Function)
- [Create Dataframe](#Create-Dataframes)
- [Merge](#Merge)

## Lambda Function

We know how to define functions. But ``apply`` and ``groupby`` sometimes require us to define a lot of functions.
Many of them are not used afterwards.
Lambda function is a way to save the name space and avoid confusion.
Below I give examples of functions defined with a def statement and then the equivalent function defined with a lambda statement.  All lambda function begin with the keyword lambda followed by the various inputs and then a colon.  Following the colon is what you want to return:

    lambda inputs: return

In [1]:
def add_five(x):
    """Adds 5 to the input x"""
    return x+5

#We call the function through the function name
add_five(10)

15

In [2]:
vc = add_five
vc(20)

vc = lambda x: x + 5

25

In [3]:
#Equivalent lambda function
f = lambda x: x+5

#We call the function through the variable that we store the lambda function in
f(10)

15

There is no need to write `return` so the function can be written in a single line. 
Here we still need a function name `f`. Later we will see that in most cases when lambda functions are used, we don't need this step.

It is the same if the function has multiple inputs.

In [3]:
f = lambda x,y: x+y
f(10,20)

30

Lambda function allows one to define a function inline, without a function name.
Note that it is not specific to pandas.

In [4]:
l = [[1,2],[5,3],[1,1],[7,4],[12,1.5]]
sorted(l)

[[1, 1], [1, 2], [5, 3], [7, 4], [12, 1.5]]

In [5]:
sorted(l, key = lambda l:l[1])

[[1, 1], [12, 1.5], [1, 2], [5, 3], [7, 4]]

Next we show an example using a lambda function in pandas.

In [5]:
import pandas as pd
df_titanic = pd.read_csv('Data/titanic.csv')

df_titanic.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [6]:
def get_title(name):
    return name.split(' ')[1]

df_titanic.Name.apply(get_title)

0          Mr.
1         Mrs.
2          Mr.
3          Mr.
4         Mrs.
        ...
413        Mr.
414          y
415        Mr.
416        Mr.
417    Master.
Name: Name, Length: 418, dtype: object

In [7]:

df_titanic.Name.apply(lambda name: name.split(' ')[1])

0          Mr.
1         Mrs.
2          Mr.
3          Mr.
4         Mrs.
        ...
413        Mr.
414          y
415        Mr.
416        Mr.
417    Master.
Name: Name, Length: 418, dtype: object

*(Exercise)*: sort the titanic dataset according to the ascending order of the last character of `Ticket`.

In [8]:
# df_titanic.dtypes
# df_titanic.Ticket.unique()
df_titanic.sort_values(by = 'Ticket', key = lambda x: x.str[-1] , ascending = True, inplace = False)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
359,1251,3,"Lindell, Mrs. Edvard Bengtsson (Elin Gerda Per...",female,30.0,1,0,349910,15.5500,NaN,S
270,1162,1,"McCaffry, Mr. Thomas Francis",male,46.0,0,0,13050,75.2417,C6,C
351,1243,2,"Stokes, Mr. Philip Joseph",male,25.0,0,0,F.C.C. 13540,10.5000,NaN,S
346,1238,2,"Botsford, Mr. William Hull",male,26.0,0,0,237670,13.0000,NaN,S
77,969,1,"Cornell, Mrs. Robert Clifford (Malvina Helen L...",female,55.0,2,0,11770,25.7000,C101,S
...,...,...,...,...,...,...,...,...,...,...,...
393,1285,2,"Gilbert, Mr. William",male,47.0,0,0,C.A. 30769,10.5000,NaN,S
135,1027,3,"Carlsson, Mr. Carl Robert",male,24.0,0,0,350409,7.8542,NaN,S
282,1174,3,"Fleming, Miss. Honora",female,NaN,0,0,364859,7.7500,NaN,Q
193,1085,2,"Lingane, Mr. John",male,61.0,0,0,235509,12.3500,NaN,Q
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S

In [17]:
df_titanic['Title'] = df_titanic['Name'].apply(lambda x: x.split()[1])
df_titanic.sort_values(by = 'Title', ascending = True, inplace = False)

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title
344,1236,3,"van Billiard, Master. James William",male,NaN,1,1,A/5. 851,14.5000,NaN,S,"Billiard,"
192,1084,3,"van Billiard, Master. Walter John",male,11.5,1,1,A/5. 851,14.5000,NaN,S,"Billiard,"
336,1228,2,"de Brito, Mr. Jose Joaquim",male,32.0,0,0,244360,13.0000,NaN,S,"Brito,"
15,907,2,"del Carlo, Mrs. Sebastiano (Argenia Genovesi)",female,24.0,1,0,SC/PARIS 2167,27.7208,NaN,C,"Carlo,"
131,1023,1,"Gracie, Col. Archibald IV",male,53.0,0,0,113780,28.5000,C51,C,Col.
...,...,...,...,...,...,...,...,...,...,...,...,...
164,1056,2,"Peruschitz, Rev. Joseph Maria",male,41.0,0,0,237393,13.0000,NaN,S,Rev.
73,965,1,"Ovies y Rodriguez, Mr. Servando",male,28.5,0,0,PC 17562,27.7208,D43,C,y
220,1112,2,"Duran y More, Miss. Florentina",female,30.0,1,0,SC/PARIS 2148,13.8583,NaN,C,y
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C,y
369,1261,2,"Pallas y Castello, Mr. Emilio",male,29.0,0,0,SC/PARIS 2147,13.8583,NaN,C,y

## Create Dataframes

In most real world applications, we will be importing data into pandas.
However, for small-scale experiments, we may want to create dataframes directly in pandas.

We are creating dataframes using a dictionary.

In [22]:
import pandas as pd
import numpy as np

#Create doctor df

doctors = pd.DataFrame({"doctor_id":[210,211,212,213],"doc_name":["Jon", "Peter", "Ke", "Pat"],
                       "degree":["MD","MBBS", "MD", "MD"]})

#Create visits
visits = pd.DataFrame({"doctor_id":[210,214,215,212,212], "patient_name": ["Julia", "TJ", "John", "James", "Jason"],
                      "year":[2015,2014, 2015, 2016, 2012]})

doctors

   doctor_id doc_name degree
0        210      Jon     MD
1        211    Peter   MBBS
2        212       Ke     MD
3        213      Pat     MD

In [3]:
visits

   doctor_id patient_name  year
0        210        Julia  2015
1        214           TJ  2014
2        215         John  2015
3        212        James  2016
4        212        Jason  2012

*(Exercise)*: Create a data frame with the following data: 
    
        Name: ['Alice', 'Bob', 'Charlie', 'David']
        Age: [20, 21, 22, 23]
        Height: [170, 180, 190, 200]
        Weight: [60, 70, 80, 90]

Check what happens if one column has more data than the others.

## Merge

The two datasets may come from different sources.
Apparently, a lot of information is connected.
We can try to merge the two dataframes and extract more information such as 

- How many patients does a doctor see?

Merge lets us combine multiple data frames. The general syntax is as follows to merge pandas dataframes df_1 and df_2:
    
    df_1.merge(df_2, how = ["inner", "outer", "left"] , left_on = left_column_name, right_on = right_column_name)

We will see how they work by examples.

### ``inner`` merge

In [14]:
#Basic inner merge
visits.merge(doctors, how  = "inner", on  = "doctor_id" )

   doctor_id patient_name  year doc_name degree
0        210        Julia  2015      Jon     MD
1        212        James  2016       Ke     MD
2        212        Jason  2012       Ke     MD

In this example:

- ``on`` means that ``left_on`` and ``right_on`` are identical.
It is the column name that you want to **match**.
- **visits** is the left dataframe and **doctors** is the right dataframe. The order matters.
- When we use ``inner``, we have lost TJ and John of the left dataframe, Peter and Pat on the right dataframe. In other words, the ``inner`` method doesn't return the rows that do not have a match in the other dataframe.
- By ``inner``, the duplicate values in the left dataframe are kept.

What happens if the matching columns have duplicated values? We have seen that those in the right dataframe are kept.
What if both columns have duplicated values?

In [27]:
doctors_dup = pd.concat([doctors, doctors])
doctors_dup["id"] = np.arange(doctors_dup.shape[0]) # just to distinguish the identical rows
doctors_dup

   doctor_id doc_name degree  id
0        210      Jon     MD   0
1        211    Peter   MBBS   1
2        212       Ke     MD   2
3        213      Pat     MD   3
0        210      Jon     MD   4
1        211    Peter   MBBS   5
2        212       Ke     MD   6
3        213      Pat     MD   7

In [28]:
visits.merge(doctors_dup, how  = "inner", on  = "doctor_id" )

   doctor_id patient_name  year doc_name degree  id
0        210        Julia  2015      Jon     MD   0
1        210        Julia  2015      Jon     MD   4
2        212        James  2016       Ke     MD   2
3        212        James  2016       Ke     MD   6
4        212        Jason  2012       Ke     MD   2
5        212        Jason  2012       Ke     MD   6

So for duplicates in either dataframe, each *unique pair* of them are presented in the merged dataframe.

### ``left`` merge

Now lets see how we can use a left merge to keep these visits that don't have a matching doctor.

In [29]:
#Basic left merge
visits.merge(doctors, how  = "left", on  = "doctor_id" ).loc[:,["patient_name", "year", "doc_name"]]

  patient_name  year doc_name
0        Julia  2015      Jon
1           TJ  2014      NaN
2         John  2015      NaN
3        James  2016       Ke
4        Jason  2012       Ke

- As expected, even when a value in the left dataframe doesn't have a match, it is still kept.
- As a result, the columns that come from the right dataframe for these rows have ``NaN`` values.
- It is useful if you don't want to lose data after the merge.
- There is a ``right`` merge that is similar to the ``left`` merge by swapping the dataframes.

### ``outer`` merge

Finally, let's see an example of an outer merge. Consider the following two dataframes.

In [32]:
#Create Two data frames
df1 = pd.DataFrame({ "id":[1,2,3,4], "Midterm":[90,85,80,82]})
df1

   id  Midterm
0   1       90
1   2       85
2   3       80
3   4       82

In [33]:
df2 = pd.DataFrame({"id":[2,3,5], "Final":[70,90,89]})
df2

   id  Final
0   2     70
1   3     90
2   5     89

Let's say I wanted to combine the records and put a zero if one of the points categories did not exist. 
It is a reasonable approach because the student may have missed the exam.
In this case I want to merge on ``id``, but instead of removing rows that do not have a match, I want to keep them and fill in 0 for the missing values.

In [34]:
#Basic outer merge
final = df1.merge(df2, how = "outer", on = "id")
final

   id  Midterm  Final
0   1     90.0    NaN
1   2     85.0   70.0
2   3     80.0   90.0
3   4     82.0    NaN
4   5      NaN   89.0

*(Question):* if we use ``left`` merge or ``right`` merge, what would happen?

Notice that the resulting data frame has a row for each id.

In [35]:
#Replace the NAN with 0
final.fillna(0, inplace = True)
final

   id  Midterm  Final
0   1     90.0    0.0
1   2     85.0   70.0
2   3     80.0   90.0
3   4     82.0    0.0
4   5      0.0   89.0

*(Exercise)*: consider three toy soccer data sets, and answer the following two questions:
- What fraction of the population does each team's fan base make up?
- How many goals are scored by players from London teams?

In [38]:
df_player = pd.DataFrame({"Player":["Milner","Coutinho","Kane","Son","Rooney","Baines","Hazard"], "Team":["Liverpool","Liverpool","Tottenham","Tottenham","Everton","Everton","Chelsea"], "Goals":[2,5,10,6,4,1,7], "Assists":[12,4,4,10,7,1,8]})
df_teams = pd.DataFrame({"Team":["Liverpool","Tottenham","Everton","Chelsea"], "Home_City":["Liverpool","London","Liverpool","London"], "Num_Fans":[0.2,2.3,0.1,5.1]})
df_city = pd.DataFrame({"City":["Liverpool","London"], "Population":[0.5,9.0]})

In [46]:
# Question 1
new_df = df_teams.merge(df_city, how = "inner", left_on = "Home_City", right_on = "City").loc[:, ["Team", "City", "Num_Fans", "Population"]]
new_df["Frac"] = new_df["Num_Fans"]/new_df["Population"]
new_df

        Team       City  Num_Fans  Population      Frac
0  Liverpool  Liverpool       0.2         0.5  0.400000
1    Everton  Liverpool       0.1         0.5  0.200000
2  Tottenham     London       2.3         9.0  0.255556
3    Chelsea     London       5.1         9.0  0.566667

To answer Question 2, think about what data sets and column do I need.

In [44]:
new_df = df_player.merge(df_teams, how = "inner", on = "Team").loc[:, ["Goals", "Home_City"]]
new_df.groupby("Home_City").sum()

           Goals
Home_City
Liverpool     12
London        23

- A Pandas cheatsheet for reference: https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf